Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Remember, the movie is encoded into JSON, so we need to help the connector produce a `Movie` from the received JSON.
ja_jp: ムービーは JSON にエンコードされていることを思い出してください。コネクタが受信した JSON から `Movie` を生成するのを支援する必要があります。

source: Remembering the initial version of the `GreetingResource` class from the <<greeting-resource-starting-point>>:
ja_jp: <<greeting-resource-starting-point>> における `GreetingResource`クラスの初期バージョンを思い出してください:

source: Reminder: do not use this to retrieve raw configured path values. As shown above, use `{config:http-path(...)}` with a known route configuration key when working with resource paths.
ja_jp: 注意：設定された生のパス値を取得するためには使用しないでください。上述のように、リソースパスを扱う際には、既知のルート設定キーを持つ `{config:http-path(...)}` を使用してください。

source: Remote Debugging
ja_jp: リモートデバッグ

source: Remote Development
ja_jp: リモート開発

source: Remote Development Mode
ja_jp: リモート開発モード

source: Remote IP address
ja_jp: リモート IP アドレス

source: Remote dev
ja_jp: リモート開発

source: Remote host name
ja_jp: リモートホスト名

source: Remote plugins that are explicitly added by the user using URL/Maven coordinates are excluded from the removal.
ja_jp: URL/Maven 座標を使用してユーザーが明示的に追加したリモートプラグインは、削除から除外されます。

source: Remote repository access through authenticated HTTPS
ja_jp: 認証されたHTTPSによるリモートリポジトリアクセス

source: Remote token introspection and UserInfo results can be shared across multiple requests to avoid doing remote introspection and/or UserInfo calls for every token all the time. By doing so the application may miss out on the immediate token status changes, for example, the token could have been revoked or de-activated, or the current user may not be actually working for the organization which issued this token any longer, making the cached token introspection or `UserInfo` information stale. Therefore, the properties related to caching token introspection and UserInfo results must be enabled by users after carefully evaluating the risks.
ja_jp: リモートトークンイントロスペクションと UserInfo の結果を複数のリクエスト間で共有することで、すべてのトークンに対して毎回リモートイントロスペクションや UserInfo の呼び出しを行うことを避けることができます。そうすることでアプリケーションは即時のトークンステータスの変更、たとえばトークンの失効や無効化、あるいは現在のユーザーがこのトークンを発行した組織に実際にはもう所属していないなどの状態を見逃し、キャッシュされたトークンイントロスペクションまたは `UserInfo` 情報が古くなる可能性があります。したがって、トークンイントロスペクションと UserInfo の結果をキャッシュすることに関連するプロパティーは、リスクを慎重に評価した上でユーザーが有効にする必要があります。

source: Remote user that was authenticated
ja_jp: 認証されたリモートユーザー

source: RemoteCacheManager and RemoteCache can be mocked.
ja_jp: RemoteCacheManager および RemoteCache はモックできます。

source: Remove any dependency to Micrometer from your pom.xml, then add the following ones instead:
ja_jp: pom.xml から Micrometer への依存関係を削除し、代わりに次の依存関係を追加します。

source: Remove any references to `RunningDevService`
ja_jp: `RunningDevService` への参照の削除

source: Remove link:#static-fields[static variables] in the extension processor (such as pointers to a service instance)
ja_jp: エクステンションプロセッサー内の link:#static-fields[静的変数] (サービスインスタンスへのポインターなど) を削除します。

source: Remove redirect parameters after redirect
ja_jp: リダイレクト後のリダイレクトパラメーターの削除

source: Remove shutdown listeners; cleanup should be handled in the `stop()` method of the service's `Startable`
ja_jp: シャットダウンリスナーを削除します。クリーンアップはサービスの `Startable` の `stop()` メソッドで処理する必要があります。

source: Remove the `quarkus-smallrye-opentracing` extension and add the `quarkus-opentelemetry` extension and the `opentelemetry-opentracing-shim` library to the build file:
ja_jp: `quarkus-smallrye-opentracing` エクステンションを削除し、 `quarkus-opentelemetry` エクステンションと `opentelemetry-opentracing-shim` ライブラリーをビルドファイルに追加します。

source: Remove the `src/main/resources/application.properties` and create a `src/main/resources/application.yaml` file.
ja_jp: `src/main/resources/application.properties` を削除し、 `src/main/resources/application.yaml` のファイルを作成します。

source: Remove the `tenant-id` attribute if the already resolved tenant configuration is not expected for the current path.
ja_jp: すでに解決されたテナント設定が現在のパスに対して予想されていない場合は、`tenant-id` 属性を削除します。

source: Remove the custom cookie.
ja_jp: カスタム Cookie を削除します。

source: Remove the non-application endpoint root
ja_jp: 非アプリケーションエンドポイントのルートの削除

source: Remove the reference if it's not actually necessary.
ja_jp: 実際に必要でない場合は、参照を削除してください。

source: Removes an entry from the cache.
ja_jp: キャッシュからエントリーを削除します。

source: Removing Standalone Lines From the Template
ja_jp: テンプレートから独立した行を削除する

source: Removing Unused Beans
ja_jp: 未使用の Bean の削除

source: Removing extension(s)
ja_jp: エクステンションの削除

source: Removing extensions
ja_jp: エクステンションの削除

source: Removing plugins
ja_jp: プラグインの削除

source: Removing the methods
ja_jp: メソッドの削除

source: Renarde support
ja_jp: レナルデ・サポート

source: Render the current process PID.
ja_jp: 現在のプロセスPIDをレンダリングします。

source: Render the log level of the message.
ja_jp: メッセージのログレベルをレンダリングします。

source: Render the name of the current process.
ja_jp: 現在のプロセスの名前をレンダリングします。

source: Render the output.
ja_jp: 出力をレンダリングする

source: Render the thread ID.
ja_jp: スレッドIDをレンダリングします。

source: Render the thread name.
ja_jp: スレッド名をレンダリングします。

source: Render the time in milliseconds since the start of the application log.
ja_jp: アプリケーションログの開始からの時間をミリ秒単位でレンダリングします。

source: Rendering Output
ja_jp: レンダリング出力

source: Rendering Periodic Reports
ja_jp: 定期レポートのレンダリング

source: Rendering messages from properties files is not yet supported.
ja_jp: プロパティファイルからのメッセージのレンダリングはまだサポートされていません。

source: Renders a date with the given date format string, which uses the syntax defined by `java.text.SimpleDateFormat`.
ja_jp: `java.text.SimpleDateFormat` で定義されている構文を使用した、指定した日付書式の文字列で日付をレンダリングします。

source: Renders a simple `%` character.
ja_jp: 単に `%` 文字をレンダリングします。

source: Renders all the values from Mapped Diagnostic Context in format `{property.key=property.value}`.
ja_jp: マッピングされた診断コンテキストからのすべての値を `{property.key=property.value}` フォーマットでレンダリングします。

source: Renders all the values from Mapped Diagnostic Context in format {property.key=property.value}
ja_jp: マッピングされた診断コンテキストのすべての値を{property.key=property.value}の形式でレンダリングします。

source: Renders all the values from Mapped Diagnostics Context in format {property.key=property.value}
ja_jp: マップされた診断コンテキストのすべての値を {property.key=property.value} 形式でレンダリングします。

source: Renders all the values from Nested Diagnostics Context in format `{value1.value2}`.
ja_jp: ネストされた診断コンテキストからのすべての値を `{value1.value2}` フォーマットでレンダリングします。

source: Renders all the values from Nested Diagnostics Context in format {value1.value2}
ja_jp: ネストされた診断コンテキストからのすべての値を {value1.value2} 形式でレンダリングします。

source: Renders just the log message, with no exception trace.
ja_jp: ログメッセージのみを表示し、例外のトレースは表示しません。

source: Renders the category name.
ja_jp: カテゴリ名をレンダリングします。

source: Renders the log message plus exception (if any).
ja_jp: ログメッセージと例外(もしあれば)を表示します。

source: Renders the platform-specific line separator string.
ja_jp: プラットフォーム固有の改行文字列をレンダリングします。

source: Renders the source class name.footnote:calc[Format sequences which examine caller information may affect performance]
ja_jp: ソースクラス名をレンダリングします。 footnote:calc[呼び出し元の情報を検査するフォーマットシーケンスはパフォーマンスに影響する可能性があります。]

source: Renders the source class name.footnote:calc[Format sequences which examine caller information might affect performance]
ja_jp: ソースクラス名をレンダリングします。footnote:calc[呼び出し元情報を調べるフォーマットシーケンスはパフォーマンスに影響する可能性があります]

source: Renders the source file name.footnote:calc[]
ja_jp: ソースファイル名をレンダリングします。 footnote:calc[]

source: Renders the source line number.footnote:calc[]
ja_jp: ソース行番号をレンダリングします。 footnote:calc[]

source: Renders the source location information, which includes source file name, line number, class name, and method name.footnote:calc[]
ja_jp: ソースファイル名、行番号、クラス名、メソッド名を含むソース・ロケーション情報をレンダリングします。 footnote:calc[]

source: Renders the source method name.footnote:calc[]
ja_jp: ソースメソッド名をレンダリングします。 footnote:calc[]

source: Renders the system simple host name.
ja_jp: システムの単純なホスト名をレンダリングします。

source: Renders the system's fully qualified host name, which may be the same as the simple host name, depending on OS configuration.
ja_jp: システムの完全修飾されたホスト名をレンダリングします。OSの設定によっては、単純ホスト名と同じかもしれません。

source: Renders the system's fully qualified host name, which may be the same as the simple host name, depending on operating system configuration.
ja_jp: システムの完全修飾子ホスト名をレンダリングします。オペレーティング・システムの構成によっては、単純なホスト名と同じになることもあります。

source: Renders the system's fully qualified host name, which might be the same as the simple host name, depending on operating system configuration.
ja_jp: システムの完全修飾ホスト名を表示します。オペレーティングシステムの設定によっては、単純なホスト名と同じになる場合があります。

source: Renders the thrown exception, if any.
ja_jp: 投げられた例外があれば、その例外をレンダリングします。

source: Renders the value from Mapped Diagnostic Context
ja_jp: マッピングされた診断コンテキストからの値のレンダリング

source: Renders the value from Mapped Diagnostic Context.
ja_jp: Mapped Diagnostic Context から値をレンダリングします。

source: Renders the value from Mapped Diagnostics Context
ja_jp: マップされた診断コンテキストの値をレンダリングします。

source: Renders your project's `README.md`, if available. Useful for onboarding or project context.
ja_jp: 利用可能な場合、プロジェクトの `README.md` をレンダリングします。オンボーディングやプロジェクトのコンテキストに役立ちます。

source: Renewing a certificate
ja_jp: 証明書の更新

source: Renewing certificates is similar to issuing the first certificate, but it requires an existing account created during the <<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> step.
ja_jp: 証明書の更新は最初の証明書の発行と似ていますが、<<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> ステップで作成された既存アカウントが必要です。

source: Repairing the Flyway schema history table
ja_jp: Flywayスキーマ履歴テーブルの修復

source: Repeatable interceptor bindings
ja_jp: 反復可能なインターセプターバインディング

source: Repeating the `@Outgoing` annotation on outbound or processing methods allows another way of dispatching messages to multiple outgoing channels:
ja_jp: 送信メソッドや処理メソッドで `@Outgoing` アノテーションを繰り返すことで、複数の送信チャネルにメッセージをディスパッチする別の方法が可能になる：

source: Replace `${chappie-extension-version}` with the latest available version. You can find the latest version on https://search.maven.org/artifact/io.quarkiverse.chappie/quarkus-chappie[search.maven.org].
ja_jp: `${chappie-extension-version}` を利用可能な最新バージョンに置き換えてください。最新バージョンは link:https://search.maven.org/artifact/io.quarkiverse.chappie/quarkus-chappie[search.maven.org] で確認できます。

source: Replace `/path/to/podman.sock` with the path you obtained previously.
ja_jp: `/path/to/podman.sock` を前に取得したパスに置き換えてください。

source: Replace `<YOUR.EVENTHUBS.CONNECTION.STRING>` with the connection string for your Event Hubs namespace. For instructions on getting the connection string, see https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-get-connection-string[Get an Event Hubs connection string]. The result would be something like:
ja_jp: `<YOUR.EVENTHUBS.CONNECTION.STRING>` は、Event Hubs 名前空間の接続文字列に置き換えます。 接続文字列を取得する手順については、 https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-get-connection-string[Get an Event Hubs connection string] を参照してください。 結果は、以下のようになります。

source: Replace `<applicationName>` and `<namespace>` with your values. Have a look at https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[Configure Service Accounts for Pods] to get further information.
ja_jp: `<applicationName>` と `<namespace>` は値に置き換えてください。 link:https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[PodのService Accountの設定] を参照して、詳細な情報を入手してください。

source: Replace `<git_path>` with the path of the Git repository that hosts your Quarkus project. For example, `oc new-app registry.access.redhat.com/ubi9/openjdk-17~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus`.
ja_jp: `<git_path>` は、QuarkusプロジェクトをホストしているGitリポジトリのパスに置き換えてください。 例えば、 `oc new-app registry.access.redhat.com/ubi9/openjdk-17~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus` です。

source: Replace `<git_path>` with the path of the Git repository that hosts your Quarkus project. For example, `oc new-app registry.access.redhat.com/ubi9/openjdk-21~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus`.
ja_jp: `<git_path>` は、QuarkusプロジェクトをホストしているGitリポジトリのパスに置き換えてください。 例えば、 `oc new-app registry.access.redhat.com/ubi9/openjdk-21~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus` です。

source: Replace `<git_path>` with the path of the Git repository that hosts your Quarkus project. For example, for Java {jdk-version-other}: `oc new-app registry.access.redhat.com/ubi9/openjdk-21~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus`.
ja_jp: `<git_path>` を、Quarkus プロジェクトをホストする Git リポジトリーのパスに置き換えます。例えば、Java {jdk-version-other} の場合: `oc new-app registry.access.redhat.com/ubi9/openjdk-21~https://github.com/johndoe/code-with-quarkus.git --name=code-with-quarkus`。

source: Replace `<project_name>` with the name of your application.
ja_jp: `<project_name>` をアプリケーション名に置き換えてください。

source: Replace a resource or create one, should be link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.4[HTTP docs])
ja_jp: リソースを置き換えるか作成します。link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.4[HTTP docs]) であるべきです。

source: Replace inline text with translation lookups
ja_jp: インラインテキストを翻訳ルックアップに置き換える

source: Replace reflection with generated bytecode
ja_jp: リフレクションを生成されたバイトコードに置き換える

source: Replace the `CrudRepository` with `PagingAndSortingRepository` in the `FruitsRepository`:
ja_jp: `FruitsRepository` における `CrudRepository` の `PagingAndSortingRepository` での置換

source: Replace the resolved tenant configuration and re-connect to the provider
ja_jp: 解決済みのテナント設定を置き換え、プロバイダーに再接続する

source: Replacing Classes in the Native Image
ja_jp: ネイティブイメージにおいてクラスを置換する

source: Replication (single shard, one node write, multiple read).
ja_jp: レプリケーション (シングルシャード、1 ノード書き込み、マルチ読み取り)。

source: Replication (single shard, one node writes, multiple read).
ja_jp: レプリケーション (シングルシャード、1 ノード書き込み、マルチ読み取り)。

source: Replication Mode
ja_jp: レプリケーションモード

source: Reply to events
ja_jp: イベントへの返信

source: Replying
ja_jp: 応答

source: Replying to messages
ja_jp: メッセージへの返信

source: Report a Vulnerability
ja_jp: 脆弱性報告

source: Reporting security issues
ja_jp: セキュリティー問題の報告

source: Repositories can be enriched with additional functionality or override the default implementation of methods of the supported Spring Data repositories. This is best shown with an example.
ja_jp: リポジトリーは、追加機能で強化したり、サポートされている Spring Data リポジトリーのメソッドのデフォルト実装をオーバーライドしたりできます。これを分かりやすく示しているのが以下の例です。

source: Repository URL
ja_jp: リポジトリー URL

source: Repository supertype
ja_jp: リポジトリのスーパータイプ

source: Repository type
ja_jp: リポジトリの型

source: Represent token as Principal
ja_jp: トークンをプリンシパルとして表現

source: Represent token as `Principal`
ja_jp: トークンを `Principal` として表現

source: Represent token as `Principal``
ja_jp: トークンを `Principal` として表現

source: Representation
ja_jp: 表現

source: Represents your domain object. This is what your API serves and modifies. Also called an `entity` in JAX-RS.
ja_jp: ドメインオブジェクトを表します。これは、API が提供および変更するものです。JAX-RS ではエンティティーとも呼ばれます。

source: Represents your domain object. This is what your API serves and modifies. Also called an `entity` in Jakarta REST.
ja_jp: ドメインオブジェクトを表します。これは、APIが提供し、変更するものです。Jakarta RESTでは `entity` とも呼ばれます。

source: Request
ja_jp: リクエスト

source: Request Body Example
ja_jp: リクエストボディの例

source: Request Context Activation
ja_jp: リクエストコンテキストの有効化

source: Request Context Lifecycle
ja_jp: リクエストコンテキストのライフサイクル

source: Request Header Example
ja_jp: リクエストヘッダーの例

source: Request Parameter Example
ja_jp: リクエストパラメーターの例

source: Request `profile` scope in addition to the default `openid` scope.
ja_jp: デフォルトの `openid` スコープに加え、 `profile` スコープを要求します。

source: Request and/or response objects (typically from the Servlet API). You may choose any specific request/response type, e.g. `ServletRequest` / `HttpServletRequest`. To use Servlet API, the `quarkus-undertow` dependency needs to be added.
ja_jp: リクエストおよび／またはレスポンスオブジェクト（通常、サーブレットAPIからのもの）。 `ServletRequest` / `HttpServletRequest` のように、 特定のリクエスト/レスポンス型を選択することができます。Servlet APIを使用するには、 `quarkus-undertow` の依存関係を追加する必要があります。

source: Request body parameter types
ja_jp: リクエストボディパラメータータイプ

source: Request cancellation
ja_jp: リクエストのキャンセル

source: Request context
ja_jp: リクエストコンテキスト

source: Request filters are usually executed on the same thread that the method that handles the request will be executed. That means that if the method servicing the request is annotated with `@Blocking`, then the filters will also be run on the worker thread. If the method is annotated with `@NonBlocking` (or is not annotated at all), then the filters will also be run on the same event-loop thread.
ja_jp: リクエストフィルターは通常、リクエストを処理するメソッドが実行されるのと同じスレッドで実行されます。つまり、リクエストを処理するメソッドが `@Blocking` でアノテーションされている場合は、フィルターもワーカスレッドで実行されます。メソッドに `@NonBlocking` のアノテーションがある場合 (あるいは全くアノテーションがない場合)、フィルターは同じイベントループのスレッドで実行されます。

source: Request filters can be declared with the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerRequestFilter.html[`@ServerRequestFilter`] annotation:
ja_jp: リクエストフィルターは、 link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerRequestFilter.html[`@ServerRequestFilter`] アノテーションで宣言できます。

source: Request header
ja_jp: リクエストヘッダー

source: Request method
ja_jp: リクエストメソッド

source: Request or response filters
ja_jp: リクエストまたはレスポンスフィルター

source: Request path `/one/two/three/four/five` matches ordered from the most specific to the least specific path
ja_jp: 最も詳細なパスから最も詳細でないパスの順に並べたリクエストパス `/one/two/three/four/five` のマッチ

source: Request paths like `/api/product/detail` can only be accessed by authenticated users.
ja_jp: `/api/product/detail` などのリクエストパスには、認証済みユーザーのみがアクセスできます。

source: Request protocol
ja_jp: リクエストプロトコル

source: Request query will include parameter with key `name`
ja_jp: リクエストクエリーには `name` をキーとするパラメーターが含まれます

source: Request relative path
ja_jp: リクエストされた相対パス

source: Request that the response of this method execution be cached in 'my-cache'
ja_jp: このメソッド実行の応答を 'my-cache' にキャッシュするようにリクエストします。

source: Request that the response of this method execution be cached in 'weather-cache'
ja_jp: このメソッド実行の応答を 'weather-cache' にキャッシュするようにリクエストします。

source: Request the access token propagation.
ja_jp: アクセストークンの伝播を要求します。

source: Request, response and redirect filters
ja_jp: リクエスト、レスポンス、およびリダイレクトフィルター

source: Requested URL path
ja_jp: リクエストされた URL パス

source: Requests a new transaction. The transaction completes when the passed action completes.
ja_jp: 新しいトランザクションを要求します。渡されたアクションが完了すると、トランザクションが完了します。

source: Requests with an invalid credential will always be rejected, even when the page is public.
ja_jp: 無効なクレデンシャルを含むリクエストは、ページが公開されている場合でも、常に拒否されます。

source: Require JWT introspection only
ja_jp: JWT イントロスペクションのみを必須にする

source: Require an authenticated access to the `/protected` endpoint.
ja_jp: `/protected` エンドポイントへのアクセスに認証を要求します。

source: Require that all the requests to the `/user-info` path have string permissions `openid`, `email` and `profile`. The same authorization can be required with the `@PermissionsAllowed(value = { "openid", "email", "profile" }, inclusive = true)` annotation instance placed on an endpoint.
ja_jp: `/user-info` パスへのすべてのリクエストに、文字列権限 `openid` 、 `email` 、 `profile` があることを要求します。同じ認可は、エンドポイントに配置された `@PermissionsAllowed(value = { "openid", "email", "profile" }, inclusive = true)` アノテーションインスタンスで要求できます。

source: Require that an opening WebSocket handshake request is authenticated using the bearer token authentication. See the xref:security-authentication-mechanisms.adoc#use-annotations-for-path-based-auth[Authentication mechanisms in Quarkus] guide for more information about selecting authentication mechanisms with annotations.
ja_jp: ベアラートークン認証を使用して、WebSocket ハンドシェイク要求が認証される必要があります。アノテーションを使用した認証メカニズムの選択に関する詳細については、 xref:security-authentication-mechanisms.adoc#use-annotations-for-path-based-auth[Quarkusの認証メカニズム] を参照してください。

source: Require that bearer access tokens must be bound to the client certificates.
ja_jp: ベアラーアクセストークンをクライアント証明書にバインドする必要があることを必須にします。

source: Require that the access tokens are provided using HTTP `Authorization DPoP` scheme value.
ja_jp: HTTP `Authorization DPoP` スキーム値を使用してアクセストークンが提供されることを要求します。

source: Require this artifact in the step executing the `native-image ...` command, and
ja_jp: `native-image ...` コマンドを実行するステップでこのアーティファクトを要求し、

source: Required
ja_jp: 必須

source: Required OIDC scopes
ja_jp: 必須の OIDC スコープ

source: Required signature algorithm
ja_jp: 必須の署名アルゴリズム

source: Requirements
ja_jp: 要件

source: Requirements and Assumptions
ja_jp: 要件と前提条件

source: Requirements and limitations
ja_jp: 要件と制限事項

source: Requires Bearer JWT verification
ja_jp: ベアラーJWTの検証が必要

source: Requires Bearer opaque token verification
ja_jp: ベアラー不透明Tokenの検証が必要

source: Requiring <<code-flow-user-info,UserInfo>> involves making a remote call on every request.
ja_jp: <<code-flow-user-info,UserInfo>> が必要な場合、リクエストごとにリモート呼び出しが実行されます。

source: Resilience with SmallRye Fault Tolerance
ja_jp: SmallRye Fault Tolerance による回復性

source: Resilient - they handle failures gracefully
ja_jp: 回復性 (Resilient) - 障害をグレースフルに処理すること

source: Resolution
ja_jp: 解決

source: Resolution of configured paths
ja_jp: 設定されたパスの解決

source: Resolve tenants with a token header name
ja_jp: トークンヘッダー名でテナントを解決する

source: Resolve tenants with a token issuer claim
ja_jp: トークン issuer のクレームでテナントを解決する

source: Resolve verification keys on start-up
ja_jp: 起動時に検証鍵を解決する

source: Resolve with `TenantResolver`
ja_jp: `TenantResolver` で解決する

source: Resolve with annotations
ja_jp: アノテーションで解決する

source: Resolved at build time
ja_jp: ビルド時に解決

source: Resolved at build time from the artifact version
ja_jp: ビルド時にアーティファクトバージョンから解決

source: Resolved at startup
ja_jp: 起動時に解決

source: Resolving Conflicts
ja_jp: 競合の解消

source: Resolving Tenant Identifiers with Annotations
ja_jp: アノテーション付きテナント識別子の解決

source: Resolving mongo+srv:// URLs
ja_jp: mongo+srv:// URL の解決

source: Resource
ja_jp: リソース

source: Resource Class
ja_jp: リソースクラス

source: Resource Class records the class that was executed. We can check whether the Resource Class was executed as expected by the HTTP Method and URI.
ja_jp: リソースクラスは実行されたクラスを記録します。 HTTP メソッドと URI によって、リソースクラスが期待どおりに実行されたかどうかを確認できます。

source: Resource Metadata properties
ja_jp: リソースメタデータプロパティー

source: Resource Method
ja_jp: リソースメソッド

source: Resource Method Before/After Listeners
ja_jp: リソースメソッド Before/Afterリスナー

source: Resource Method records the method that was executed. We can check if the Resource Method was executed as expected by the HTTP Method and URI.
ja_jp: リソースメソッドは実行されたメソッドを記録します。 HTTP メソッドと URI によって、リソースメソッドが期待どおりに実行されたかどうかを確認できます。

source: Resource and Provider discovery
ja_jp: リソースとプロバイダーのディスカバリー

source: Resource attributes common to all telemetry data.
ja_jp: すべてのテレメトリーデータに共通するリソース属性。

source: Resource bundles can be registered to be included in the native image by using `@RegisterResourceBundle`:
ja_jp: リソースバンドルは、 `@RegisterResourceBundle` を使用して、ネイティブイメージに含めるように登録できます：

source: Resource customisation
ja_jp: リソースのカスタマイズ

source: Resource identifier
ja_jp: リソース識別子

source: Resource registration
ja_jp: リソース登録

source: Resources
ja_jp: リソース
